#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьФорму(Форма) Экспорт
	ИмяФормы = Форма.ИмяФормы; 
	
Если Имяформы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
	ДобавитьПолеКонтактноеЛицоГруппаШапкаПраво(Форма);
ИначеЕсли 
	Имяформы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда ДобавитьПолеКонтактноеЛицоГруппаШапкаПраво(Форма);
ИначеЕсли 
	Имяформы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда ДобавитьПолеКонтактноеЛицоГруппаШапкаПраво(Форма);
ИначеЕсли 
	ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма);
ИначеЕсли 
	Имяформы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма); 
КонецЕсли;

КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоГруппаШапкаПраво(Форма)

	
	ПолеВвода = Форма.Элементы.Добавить("нет_КонтактноеЛицо",Тип("Полеформы"),Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
	
	Если Форма.Элементы.Найти("СогласованнаяСкидка") = Неопределено И Форма.Заголовок = "Заказ Покупателя" Тогда
        ПолеВвода2 = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСуммаДокумента);
        ПолеВвода2.Вид = ВидПоляФормы.ПолеВвода; 
        ПолеВвода2.ПутьКДанным = "Объект.Нет_СогласованнаяСкидка";
        ПолеВвода2.Заголовок = "СогласованнаяСкидка";
		ПолеВвода2.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");

	КонецЕсли;
	
		
КонецПроцедуры 


Процедура ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма)

	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("Полеформы"),,Форма.Элементы.СуммаДокумента); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
	
КонецПроцедуры 

#КонецОбласти